/*
SQLyog Ultimate v10.42 
MySQL - 5.6.26-log : Database - requestrepair
*********************************************************************
*/

/*!40101 SET NAMES utf8 */;

/*!40101 SET SQL_MODE=''*/;

/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;
CREATE DATABASE /*!32312 IF NOT EXISTS*/`requestrepair` /*!40100 DEFAULT CHARACTER SET utf8 */;

USE `requestrepair`;

/*Table structure for table `vehicle` */

DROP TABLE IF EXISTS `vehicle`;

CREATE TABLE `vehicle` (
  `vehicle_ID` int(25) NOT NULL AUTO_INCREMENT,
  `carplate` char(50) DEFAULT NULL,
  `type_vehicle` char(50) DEFAULT NULL,
  `brand` char(50) DEFAULT NULL,
  `model` char(50) DEFAULT NULL,
  `serialnumber` char(50) DEFAULT NULL,
  `body_Number` char(50) DEFAULT NULL,
  `date_vehicle` date DEFAULT NULL,
  `durable_articles_Number` char(50) DEFAULT NULL,
  `mile` char(50) DEFAULT NULL,
  `vehicle_Price` char(50) DEFAULT NULL,
  `picture_Vehicle` char(50) DEFAULT NULL,
  `status_vehicle` char(50) DEFAULT NULL,
  PRIMARY KEY (`vehicle_ID`)
) ENGINE=MyISAM AUTO_INCREMENT=59 DEFAULT CHARSET=utf8;

/*Data for the table `vehicle` */

insert  into `vehicle`(`vehicle_ID`,`carplate`,`type_vehicle`,`brand`,`model`,`serialnumber`,`body_Number`,`date_vehicle`,`durable_articles_Number`,`mile`,`vehicle_Price`,`picture_Vehicle`,`status_vehicle`) values (17,'กต 5268','รถ10ล้อ','TOYOTA (สีบอร์นเงิน)','CAMRY','MRO53FK4000003810','2AZ-H354724','2009-09-17','มฟล.2310-002-001-52-001','0','1,500,000','20161101084243.','ปกติ'),(16,'กม 3461','รถกระบะ4ประตู','TOYOTA','วีโก้ 4 ประตู','MR0FR29G501028349','2KD-S248772','2014-06-17','2320-008-001-57-002','0','600,000','20161101081248.jpg','ปกติ'),(18,'นข 2333','รถตู่','VOLKSWAGEN  (สีเทา)','คาราเวล','WV222Z70Z2H 097658','AMV 002179','2002-03-03','มฟล.2310-004-002-45-001','0','2,400,000','20161101084659.jpg','ปกติ'),(19,'กฉ 4180','รถรับรอง','TOYOTA  (สีบอร์นเงิน)','CAMRY','MRO53BK4107016158','1AZ-E057081','2007-11-08','มฟล.2310-002-001-50-001','0','1,258,000','20161102083052.jpg','ปกติ'),(20,'กจ 535','รถตู่','-','คอมมิวเตอร์','MR053BK3005025526','2AZ-3145319','2004-12-13','-','0','1,526,783','20161102083522.jpg','ปกติ'),(21,'กค 8581','รถเก๋ง','TOYOTA  (สีเทา)','CAMRY','MR053SK2006009862','5S-4379363','2001-06-29','มฟล.2310-002-001-44-001','0','1,270,000','20161102083759.jpg','ปกติ'),(22,'นข 4484','รถตู้','TOYOTA  (สีเทา)','คอมมิวเตอร์','JTFSS22P300043196','2KD-1735735','2008-01-21','2310-002-001-51-002','0','1,071,000','20161102083949.jpg','ปกติ'),(23,'นข 4485','รถตู้','ยี่ห้อ TOYOTA  (สีเทา)','คอมมิวเตอร์','JTFSS22PX00042725','2KD-1732512','2008-01-21','2310-002-002-51-001','0','1,071,000','20161102084106.jpg','ปกติ'),(24,'นข 3583','รถตู้','TOYOTA  (สีเทา)','คอมมิวเตอร์','JTFSS22P000013797','2KD-1418156','2006-01-26','2310-004-001-49-001','0','1,078,600','20161102084242.jpg','ปกติ'),(25,'นข 3584','รถตู้','TOYOTA  (สีเทา)','คอมมิวเตอร์','JTFSS22P000013931','2KD-1420478','2006-04-26','มฟล.2310-004-001-49-002','0','1,078,600','20161102084432.jpg','ปกติ'),(26,'นข 6452','รถตู้','TOYOTA  (สีเทา)','คอมมิวเตอร์','JTFSS22P700098170','2KD-5587740','2012-02-09','มฟล.2310-002-001-55-01','0','1,154,000','20161103071655.jpg','ปกติ'),(27,'นข 6453','รถตู้','TOYOTA  (สีเทา)','คอมมิวเตอร์','JTFSS22P800098193','2KD-5595114','2012-02-06','มฟล.2310-002-001-55-02','0','1,154,000','20161103072007.jpg','ปกติ'),(28,'นข 5329','รถตู้','ไฮเอท','ไอเอท','-','-','2009-09-17','2310-002-001-53-001','0','1,500,000','20161103072201.jpg','ปกติ'),(29,'นข 1054','รถตู้','TOYOTA    (สีเทา)','ไฮเอท','LH113-0157630','3L-4344659','1997-11-27','มฟล.2310-004-001-40-001','0','730,000','20161103072417.jpg','ปกติ'),(30,'นข 1055','รถตู้','TOYOTA  (สีขาว)','ไฮเอท','LH113-7008312','3L-4608029','1998-11-11','มฟล.2310-004-001-41-001','0','-','20161103072638.jpg','ปกติ'),(31,'นข 2521','รถตู้','TOYOTA  (สีขาว)','คอมมิวเตอร์','LH184-1015414','5L-5346047','2003-09-05','มฟล.2310-004-001-46-001','0','1,014,000','20161103072819.jpg','ปกติ'),(32,'นข 2787','รถตู้','TOYOTA (สีเขียว)','LH184R-2RMNS','LH184-0002715','5Ll-4766177','1999-08-11','มฟล.2310-004-001-47-002','0','93715.65','20161103073139.jpg','ปกติ'),(33,'นข 1983','รถตู้','TOYOTA  (สีขาว)','คอมมิวเตอร์','LH184-1007577','5L-5156310','2002-03-12','มฟล.2310-004-001-45-001','0','922,000','20161103073258.jpg','ปกติ'),(34,'บว 2801','รถกระบะ','TOYOTA (สีเทา)','VIGO','MROCS12GX00095532','2KD-5217988','2011-01-24','มฟล.2320-008-001-54-001','0','444,000','20161103073613.','ปกติ'),(35,'กค 6438','รถแวน','ISUZU  (สีเขียว)','TFS55HPY','TFS55HPVV-7106100','4JB1-G10160','1998-09-18','มฟล.2320-008-001-41-001','0','899,000','20161103073833.jpg','ปกติ'),(36,'กง 3209','รถกระบะ','FORD  (สีเทา)','RANGER','MNBBSFE801W198567','MNBBSFE801W198567','2002-04-24','มฟล.2320-008-003-46-001','0','444,616.06','20161103074312.jpg','ปกติ'),(37,'บธ 6254','รถกระบะ','MITSUBISHI  (สีเทา)','K77TCENDRU','MMTCNK 77 HWD 005866','EA5862','1998-10-16','มฟล.2320-008-002-41-001','0','-','20161103074444.jpg','ปกติ'),(38,'บบ 8596','รถกระบะ','TOYOTA   (สีขาว)','LN90R-CRMSSTS','LN90-8280840','2L-9489949','1997-08-27','มฟล.2320-008-001-47-001','0','72,326.24','20161103074637.jpg','ปกติ'),(39,'บพ 604','รถกระบะ','ยี่ห้อ FORD  (สีเทา)','UM48RAJ (2004)','MNBBSBD304W394685','WLAT4841100','2004-10-05','มฟล.2320-008-001-47-002','0','410,000','20161103074800.','ปกติ'),(40,'40-0135','รถบัส','HINO','RK8JSLA','RK8JSLA10017','J08E-UD10124','2008-08-28','มฟล.2310004004004510','0','3,978,000','20161103074958.','ปกติ'),(41,'40-0130','รถมินิบัส','ISUZU','NQR75RB52G','NQR75RB5277100143','4HK1-489411','2008-05-02','-','0','1,885,000','20161103075128.','ปกติ'),(42,'40-0155','รถบัส40ที่นั่ง','HINO','RK8JSLA','RK8JSLA12108','J08E-UD13602','2011-05-31','มฟล. 231000400454001','0','4,100,000','20161103083044.','ปกติ'),(43,'40-0188','รถมินิบัส24ที่นั่ง','HINO','FC9JJKA','FC9JJKA14790','JO5ETDH14294','2014-02-05','มฟล. 2310-004-003-57-001','0','2,850,000','20161103083222.','ปกติ'),(44,'81-8819','รถบรรทุกหกล้อ','HINO  (สีขาว)','FC4JJPA','FC4JJPA14871','J05C-TK17139','2007-11-12','2320-004-002-51-001','0','-','20161103083427.jpg','ปกติ'),(45,'81-8816','รถหกล้อ','อีซูซู (แดง)','NQR70LY52B','-','JO8C-TS12234','2005-03-09','มฟล. 232000400148001','0','1,650,000','20161103083802.jpg','ปกติ'),(46,'บย 4704','รถบรรทุกหกล้อ','HINO','XZU343R-HKMQBT3','MNKCJ41H804000209','NO4C-TS10825','2007-11-09','-','0','1,050,000','20161103084037.','ปกติ'),(47,'81-8818','รถบรรทุกหกล้อ:รถบรรทุกน้ำ(ดับเพลิง)','HINO(สีฟ้า)','FM','FM1JNKA-10565','J08C-F12222','2005-07-04','มฟล.2320-004-001-48-00','0','-','20161103084556.jpg','ปกติ'),(48,'81-8817','รถหกล้อ','HINO  (สีส้ม)','FG1JGPD','FG1JGPD-10065','JO8C-TS12234','2003-06-25','มฟล.2320-004-001-46-001','0','1390000','20161103084705.jpg','ปกติ'),(49,'ตค 752','รถแทรคเตอร์','NEW HOLLAN','-','Z5CE08965','450/NA*148469','2005-11-01','มฟล.2305-001-001-49-001','0','1,480,000','20161103085034.','ปกติ'),(50,'ขลร 787','รถจักรยานยนต์','HONDA','WAVE Z','NF100TK-0026957','NF100TKE-0026957','2006-08-02','มฟล.2340-001-001-49-002','0','28,000','20161103085201.','ปกติ'),(51,'ขลร 789','รถจักรยานยนต์','HONDA','WAVE Z','NF100TKE-0024958','NF100TKE-0024958','2006-08-02','มฟล.2340-001-001-49-003','0','28,000','20161103085315.','ปกติ'),(52,'คตค 863','รถจักรยานยนต์','HONDA','DREAM','ND125-0388358','ND125E-0388358','2010-03-31','มฟล.2310-004-001-49-001','0','38,000','20161103085436.','ปกติ'),(53,'รถไฟฟ้าคันที่ 2','รถไฟฟ้า กอร์ฟ','','','','','2011-04-04','มฟล. 2310-006-001-54-001','0','-','20161103085608.','ปกติ'),(54,'.  รถโดยสาร ขนาด 28 ที่นั่ง','รถโดยสาร ขนาด 28 ที่นั่ง','','','','','2013-12-12',' มฟล.2310-004-005-57-001','0','620,000','20161103085733.','ปกติ'),(55,'ตค 8837','รถแทรคเตอร์','แบ็คโฮ','คูโบต้าkx91-3 s2','55724','D1703-7CR3829','2014-09-22','มฟล.2305-001-002-57-001','0','1,350,000','20161103085944.','ปกติ'),(56,'1กง 8050','รถจักรยานยนต์','HONDA','WEVE 125I','MLHJA2122D5078735','JA212E-0078735','2014-03-10','มฟล.2340-001-001-57-001','0','47,500','20161103090159.','ปกติ'),(57,'1กง 8279','รถจักรยานยนต์','HONDA','WEVE 125I','MLHJA2128D5086600','JA212E-0086600','2014-03-13','มฟล.2340-001-001-57-002','0','47,500','20161103090303.','ปกติ'),(58,'81-8854','รถหกล้อ','-','FRR90LNXXQ','MP1FRR90LDT001323','4HK-115120','2014-10-22','มฟล.2320-004-002-58-001','0','1,620,000','20161103090419.jpg','ปกติ');

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;
